; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v13)
             (pred_1 ?v5 ?v8)
             (pred_11 ?v10 ?v8)
             (pred_8 ?v3 ?v10 )
	     (pred_4 ?v10)
             (pred_12 ?v4)
             (pred_9 ?v5)
             (pred_10 ?v8)
             (pred_7 ?v10)
             (pred_5 ?v5)
             (pred_6 ?v10)
             (pred_2 ))



(:action op_4
:parameters (?v6 ?v1 ?v11 ?v2)
:precondition (and (pred_12 ?v6) (pred_12 ?v1) (pred_9 ?v11) (pred_10 ?v2)
          (pred_3 ?v6 ?v1) (pred_1 ?v11 ?v2)
                   (pred_11 ?v1 ?v2) (pred_4 ?v6) 
                   (pred_7 ?v1) (pred_5 ?v11))
:effect (and  (pred_6 ?v1) (not (pred_7 ?v1))))


(:action op_5
:parameters (?v6 ?v9)
:precondition (and (pred_12 ?v6) (pred_12 ?v9)
               (pred_4 ?v6) (pred_3 ?v6 ?v9) (pred_6 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v6))))

(:action op_2
:parameters (?v6 ?v11)
:precondition (and (pred_12 ?v6) (pred_9 ?v11) 
                  (pred_4 ?v6) (pred_8 ?v11 ?v6) (pred_2 ))
:effect (and (pred_5 ?v11)
   (not (pred_8 ?v11 ?v6)) (not (pred_2 ))))


(:action op_1
:parameters (?v6 ?v7 ?v12)
:precondition (and (pred_12 ?v6) (pred_9 ?v7) (pred_9 ?v12)
                  (pred_4 ?v6) (pred_5 ?v12) (pred_8 ?v7 ?v6))
:effect (and (pred_5 ?v7) (pred_8 ?v12 ?v6)
        (not (pred_5 ?v12)) (not (pred_8 ?v7 ?v6))))

(:action op_3
:parameters (?v6 ?v11)
:precondition (and (pred_12 ?v6) (pred_9 ?v11) 
                  (pred_4 ?v6) (pred_5 ?v11))
:effect (and (pred_2 ) (pred_8 ?v11 ?v6) (not (pred_5 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_02 obj_04 obj_22 obj_27 obj_31 obj_30 obj_05 obj_23 obj_08 obj_21 obj_17 obj_01 obj_28 obj_14 obj_26 obj_15 obj_25 obj_18 obj_16 obj_13 obj_09 obj_10 obj_06 obj_29
    obj_19 obj_20 obj_12
    obj_03 obj_24 obj_07
    )

    (:init
       (pred_2)

       (pred_12 obj_11)
       (pred_12 obj_02)
       (pred_12 obj_04)
       (pred_12 obj_22)
       (pred_12 obj_27)
       (pred_12 obj_31)
       (pred_12 obj_30)
       (pred_12 obj_05)
       (pred_12 obj_23)
       (pred_12 obj_08)
       (pred_12 obj_21)
       (pred_12 obj_17)
       (pred_12 obj_01)
       (pred_12 obj_28)
       (pred_12 obj_14)
       (pred_12 obj_26)
       (pred_12 obj_15)
       (pred_12 obj_25)
       (pred_12 obj_18)
       (pred_12 obj_16)
       (pred_12 obj_13)
       (pred_12 obj_09)
       (pred_12 obj_10)
       (pred_12 obj_06)
       (pred_12 obj_29)
       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_12)
       (pred_9 obj_03)
       (pred_9 obj_24)
       (pred_9 obj_07)

       (pred_3 obj_11 obj_31)
       (pred_3 obj_11 obj_02)
       (pred_3 obj_02 obj_30)
       (pred_3 obj_02 obj_04)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_04 obj_22)
       (pred_3 obj_04 obj_02)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_22 obj_27)
       (pred_3 obj_22 obj_04)
       (pred_3 obj_27 obj_08)
       (pred_3 obj_27 obj_22)
       (pred_3 obj_31 obj_21)
       (pred_3 obj_31 obj_30)
       (pred_3 obj_31 obj_11)
       (pred_3 obj_30 obj_17)
       (pred_3 obj_30 obj_05)
       (pred_3 obj_30 obj_02)
       (pred_3 obj_30 obj_31)
       (pred_3 obj_05 obj_01)
       (pred_3 obj_05 obj_23)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_05 obj_30)
       (pred_3 obj_23 obj_28)
       (pred_3 obj_23 obj_08)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_23 obj_05)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_08 obj_27)
       (pred_3 obj_08 obj_23)
       (pred_3 obj_21 obj_26)
       (pred_3 obj_21 obj_17)
       (pred_3 obj_21 obj_31)
       (pred_3 obj_17 obj_15)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_30)
       (pred_3 obj_17 obj_21)
       (pred_3 obj_01 obj_25)
       (pred_3 obj_01 obj_28)
       (pred_3 obj_01 obj_05)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_28 obj_18)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_28 obj_23)
       (pred_3 obj_28 obj_01)
       (pred_3 obj_14 obj_16)
       (pred_3 obj_14 obj_08)
       (pred_3 obj_14 obj_28)
       (pred_3 obj_26 obj_13)
       (pred_3 obj_26 obj_15)
       (pred_3 obj_26 obj_21)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_25)
       (pred_3 obj_15 obj_17)
       (pred_3 obj_15 obj_26)
       (pred_3 obj_25 obj_10)
       (pred_3 obj_25 obj_18)
       (pred_3 obj_25 obj_01)
       (pred_3 obj_25 obj_15)
       (pred_3 obj_18 obj_06)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_18 obj_28)
       (pred_3 obj_18 obj_25)
       (pred_3 obj_16 obj_29)
       (pred_3 obj_16 obj_14)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_13 obj_09)
       (pred_3 obj_13 obj_26)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_13)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_10 obj_25)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_06 obj_29)
       (pred_3 obj_06 obj_18)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_29 obj_16)
       (pred_3 obj_29 obj_06)
       (pred_7 obj_16)
       (pred_7 obj_22)
       (pred_7 obj_25)
       (pred_11  obj_16 obj_19)
       (pred_11  obj_22 obj_20)
       (pred_11  obj_25 obj_12)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_04)
       (pred_6 obj_27)
       (pred_6 obj_31)
       (pred_6 obj_30)
       (pred_6 obj_05)
       (pred_6 obj_23)
       (pred_6 obj_08)
       (pred_6 obj_21)
       (pred_6 obj_17)
       (pred_6 obj_01)
       (pred_6 obj_28)
       (pred_6 obj_14)
       (pred_6 obj_26)
       (pred_6 obj_15)
       (pred_6 obj_18)
       (pred_6 obj_13)
       (pred_6 obj_09)
       (pred_6 obj_10)
       (pred_6 obj_06)
       (pred_6 obj_29)

       (pred_1  obj_03 obj_19)
       (pred_1  obj_24 obj_20)
       (pred_1  obj_07 obj_12)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_24 obj_21)
       (pred_8 obj_07 obj_05)
       (pred_4 obj_06)
    )

    (:goal (and
       (pred_8 obj_03 obj_17)
       (pred_8 obj_24 obj_10)
    ))
(:constraints
  (always (not (pred_4 obj_30)))
)
)

; plan
1. (op_5 obj_06 obj_10)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_10)
   goals met: 0 of 2
2. (op_5 obj_10 obj_09)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_09)
   goals met: 0 of 2
3. (op_5 obj_09 obj_15)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_15)
   goals met: 0 of 2
4. (op_5 obj_15 obj_17)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_17)
   goals met: 0 of 2
5. (op_5 obj_17 obj_21)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_21)
   goals met: 0 of 2
6. (op_2 obj_21 obj_24)
   deleted: (pred_8 obj_24 obj_21) (pred_2)
   added: (pred_5 obj_24)
   goals met: 0 of 2
7. (op_5 obj_21 obj_31)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_31)
   goals met: 0 of 2
8. (op_5 obj_31 obj_11)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_11)
   goals met: 0 of 2
9. (op_1 obj_11 obj_03 obj_24)
   deleted: (pred_5 obj_24) (pred_8 obj_03 obj_11)
   added: (pred_5 obj_03) (pred_8 obj_24 obj_11)
   goals met: 0 of 2
10. (op_5 obj_11 obj_31)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_31)
   goals met: 0 of 2
11. (op_5 obj_31 obj_21)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_21)
   goals met: 0 of 2
12. (op_5 obj_21 obj_17)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_17)
   goals met: 0 of 2
13. (op_3 obj_17 obj_03)
   deleted: (pred_5 obj_03)
   added: (pred_2) (pred_8 obj_03 obj_17)
   goals met: 1 of 2
14. (op_5 obj_17 obj_21)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_21)
   goals met: 1 of 2
15. (op_5 obj_21 obj_31)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_31)
   goals met: 1 of 2
16. (op_5 obj_31 obj_11)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_11)
   goals met: 1 of 2
17. (op_2 obj_11 obj_24)
   deleted: (pred_8 obj_24 obj_11) (pred_2)
   added: (pred_5 obj_24)
   goals met: 1 of 2
18. (op_5 obj_11 obj_31)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_31)
   goals met: 1 of 2
19. (op_5 obj_31 obj_21)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_21)
   goals met: 1 of 2
20. (op_5 obj_21 obj_17)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_17)
   goals met: 1 of 2
21. (op_5 obj_17 obj_15)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_15)
   goals met: 1 of 2
22. (op_5 obj_15 obj_09)
   deleted: (pred_4 obj_15)
   added: (pred_4 obj_09)
   goals met: 1 of 2
23. (op_5 obj_09 obj_10)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_10)
   goals met: 1 of 2
24. (op_3 obj_10 obj_24)
   deleted: (pred_5 obj_24)
   added: (pred_2) (pred_8 obj_24 obj_10)
   goals met: 2 of 2
